# Practice

Предположим, что в программе определён макрос sqr.

    #define sqr(x) x * x

Какое значение будет иметь следующее выражение?

    sqr(3 + 0)

 - 3

Задача № 1

Напишите функцию power, реализующую возведение целого числа в неотрицательную целую степень. Функция power должна принимать на вход два целых числа и возвращать целое число (смотрите шаблон кода). При выполнении задания учтите, что функция обязательно должна называться power, функция ничего не должна читать со входа или выводить.
Требования к реализации: в этом задании вам нужно реализовать только функцию power. Вы можете определять вспомогательные функции, если они вам нужны. Реализовывать функции main не нужно. 
Ограничения: библиотеку cmath (и math.h) использовать запрещено.

Решение:

    // определите только функцию power, где
    //    x - число, которое нужно возвести в степень
    //    p - степень, в которую нужно возвести x

    int power(int x, unsigned p) {
        int answer = 1;
        for (int i = 1; i <= p; ++i)
        {
            answer = answer * x;
        }
        /* считаем answer */
        return answer;
    }
    
Задача № 2

Реализуйте макрос MAX от трёх параметров, который присваивает целочисленной (int) переменной, переданной в качестве третьего аргумента, наибольшее из значений, переданных в первых двух аргументах. Пример вызова макроса:

    int a = 10;
    int b = 20;
    int c = 0;
    MAX(a, b, c); // теперь c равно 20
    MAX(a += b, b, c); // теперь a = с = 30
    
При написании макроса постарайтесь учесть как можно больше вариантов его использования. 
Требования к реализации: вам нужно реализовать только макрос MAX. Функцию main и какие-либо другие функции реализовывать не нужно. Попробуйте решить эту задачу исключительно средствами макросов.

Решение:

    #define MAX(x, y, r) { int a_ = (x), b_ = (y); int c_ = a_ > b_ ? a_ : b_; r = c_; }
    
Задача № 3

Простая задача на закрепления материала по работе с  вводом/выводом. Напишите программу, которая суммирует целые числа. На вход программе подаются целые числа в следующем формате: на первой строке идет целое число T — количество тестов, далее следует T строк, в каждой из которых через пробел идут два целых числа ai и bi. На выводе для каждой из T строк нужно вывести сумму ai+bi  в том порядке, в котором пары поступают на вход. Ничего, кроме этого, выводить не нужно.
В следующем примере строки ввода и вывода разделены. При считывания пользовательского ввода с консоли и выводе на консоль соответствующие строки ввода и вывода будут идти друг за другом.

Решение:

    #include <iostream>
    using namespace std;

    int main()
    {
        int c = 0;
        cin >> c;
        for (int i = 1; i <= c; ++i)
        {
            int a = 0, b = 0;
            cin >> a >> b;
            cout << (a + b) << endl;
        }
        return 0;
    }
    
Задача № 4

Напишите программу для решения квадратных уравнений вида ax2+bx+c=0 (относительно x). На вход программа получает три целых числа: a , b и c, соответственно. При этом гарантируется, что a≠0. На вывод программа должна вывести два вещественных корня уравнения, разделённые пробелом. Если вещественных корней нет, то программа должна вывести строку "No real roots". Если у уравнения имеется только один корень (кратный корень), то программа должна вывести его дважды. Порядок вывода корней не важен. Ничего, кроме этого, выводить не нужно. Для вычислений с плавающей точкой используйте тип double. При выполнении задания вам может оказаться полезной функция sqrt из заголовочного файла cmath.

Решение:

    #include <iostream>
    using namespace std;
    #include <cmath>

    int main()
    {
        int a, b, c;
        double x1, x2;
        cin >> a >> b >> c;
        double d = b * b - 4 * a * c;
        if (d < 0)
            cout << "No real roots";
        else
        {
            x1 = ((-b + sqrt(d))/(2 * a));
            x2 = ((-b - sqrt(d))/(2 * a));
            cout << x1 << " " << x2;
        }
        return 0;
    }

Задача № 5

Напишите программу, которая посимвольно читает из std::cin, пока не достигнет конца потока ввода, и заменяет несколько подряд идущих пробелов одним и выводит полученный результат в std::cout. Никаких других символов, кроме пробелов удалять не нужно. При выполнении задания вам не разрешается пользоваться дополнительной памятью, а именно: массивами, стандартными контейнерами и строками, даже если вы уже с ними знакомы. Вы можете определять любые вспомогательные функции, если они вам нужны.

Решение:

    #include <iostream>
    using namespace std;

    int main()
    {
        char c = '\0';
        while (cin.get(c)) {
            while (c == ' ' && cin.peek() == ' ')
                cin.get(c);
            cout << c;
        }
    return 0;
    }
    
Задача № 6

Напишите программу для вычисления целочисленного логарифма по основанию 2. На вход программе в первой строке подается число T, далее следует T строк с тестами. Каждый тест состоит из одного целого положительного числа ai<109, для каждого ai нужно вывести на отдельной строке такое наибольшее число p, что 2p≤ai. Гарантируется, что ai≥1 . При решении задачи вы можете определять любые вспомогательные функции, если они вам нужны, более того рекомендуется вынести вычисление логарифма в отдельную функцию.
Ограничения: библиотеку cmath (и math.h) использовать запрещено.

Решение:

    #include <iostream>
    using namespace std;

    int main()
    {
        int t, num, m, n;
        cin >> t;
        for (int i = 1; i <= t; ++i){
            m = 1, n = 0;
            cin >> num;
            while (num >= m){
                m = m * 2;
                n = n + 1;
            }
            cout << (n - 1) << endl;
        }
        return 0;
    }
