# Practice

В коде программы определена следующая функция:

    int foo(int n) {
        if (n <= 0)
            return 1;
        return foo((n * 2) / 3) + foo(n - 2);
    }

Нужно посчитать, сколько всего раз будет вызвана функция foo, если ее вызвать с аргументом 3 (т.е. foo(3)). Самый первый вызов тоже нужно посчитать. 

 - 9

Задача № 1

Напишите рекурсивную функцию вычисления наибольшего общего делителя двух положительных целых чисел (Greatest Common Divisor, GCD). Для этого воспользуйтесь следующими свойствами:

GCD(a,b)=GCD(b,amodb) 
GCD(0,a)=a 
GCD(a,b)=GCD(b,a)

Требования к реализации: в данном задании запрещено пользоваться циклами. Вы можете заводить любые вспомогательные функции, если они вам нужны. Функцию main определять не нужно.

Решение:

    #include <math.h>
    int gcd(int a, int b)
    {
        int c;
        if (a >= b){
            if (a % b == 0)
                return b;
            else{
                c = a % b;
                return gcd(c, b);
            }
        }
        else{
            if (b % a == 0)
                return a;
            else{
                c = b % a;
                return gcd(a, c);
            }
        }
    }
    
Задача № 2

Вам требуется написать программу, которая "переворачивает" последовательность положительных целых чисел. На вход подается последовательность разделенных пробелами положительных целых чисел. Последовательность заканчивается нулем. Требуется вывести эту последовательность в обратном порядке.
На выводе числа нужно так же разделить пробелами. Завершающий ноль — это просто индикатор конца последовательности, он не является ее частью, т.е. выводить его не нужно.

Требования к реализации: в данном задании запрещено использовать циклы, а также дополнительную память: массивы, строки или контейнеры (даже, если вы с ними уже знакомы). Вам разрешено заводить вспомогательные функции, если они вам нужны.

Подсказка: используйте рекурсию.

Решение:

    #include <iostream>
    using namespace std;

    void obr()
    {
        int a;
        cin >> a;
        if (a == 0) 
            return;
        obr();
        cout << a << " ";   
    }
 
    int main()
    {
        obr();  
        return 0;
    }
